app/Http/Controllers/CommentsController.php

INSERT INTO `comments` (`name`, `email`, `comment`, `podcast_id`, `updated_at`, `created_at`) VALUES ('Farrah Lynch', 'huhehagad@mailinator.com', 'Ipsum aut natus veni', '8', '2023-03-14 15:45:44', '2023-03-14 15:45:44')
---
    public function store(Request $request)
    {

        $formFields = $request->validate([
            'name' => 'required',
            'email' => 'required',
            'comment' => 'required'
        ]);

        $getPreviousUrl = $request->session()->get('_previous');
        $getPreviousUrlId = strstr($getPreviousUrl["url"], "podcasts/");
        $getPreviousUrlId = str_replace("podcasts/", "", $getPreviousUrlId);

        $formFields['podcast_id'] = $getPreviousUrlId;

        Comment::create($formFields);