app/Http/Controllers/PodcastController.php

SELECT * FROM `podcasts` WHERE `tags` like '%Javascript%' ORDER BY `created_at` DESC LIMIT 8 offset 0
SELECT count(*) as aggregate FROM `podcasts` WHERE `tags` like '%Javascript%'
---
    public function index(Request $request): Factory|View|Application
    {
        return view('podcasts.index', [
            'podcasts' => Podcast::latest()->filter(request(['tag', 'search']))->paginate(8)
        ]);

SELECT * FROM `comments`
---
    public function show(Podcast $podcast, Comment $comments): Factory|View|Application
    {

        $comments = Comment::all();

INSERT INTO `podcasts` (`title`, `host`, `location`, `email`, `website`, `tags`, `description`, `logo`, `file_name`, `user_id`, `updated_at`, `created_at`) VALUES ('Javascript', 'Levis Salom', 'Ohio', 'zajicyxeje@mailinator.com', 'https://www.puq.co.uk', 'Javascript', 'Reprehenderit aliqu', 'logos/q8Ll1sUJCGsfFlsQ7q2BgppLkcvAwNH7hbDWn1ga.jpg', 'sounds/kJVQ7YBIWroKLw0TaoiM1BbDBKjiP9d2jVd4m4Us.mp3', 3, '2023-03-16 09:05:34', '2023-03-16 09:05:34')
---
    public function store(Request $request): Redirector|Application|RedirectResponse
    {

        $formFields = $request->validate([
            'title' => 'required',
            'host' => ['required', Rule::unique('podcasts', 'host')],
            'location' => 'required',
            'email' => 'required',
            'website' => 'required',
            'tags' => 'required',
            'description' => 'required'
        ]);

        if ($request->hasFile('logo')) {
            $formFields['logo'] = $request->file('logo')->store('logos', 'public');
        }

        if ($request->hasFile('file_name')) {
            $formFields['file_name'] = $request->file('file_name')->store('sounds', 'public');
        }

        $formFields['user_id'] = auth()->id();

        Podcast::create($formFields);

UPDATE `podcasts` SET `tags` = 'Laravel', `podcasts`.`updated_at` = '2023-03-16 09:06:52' WHERE `id` = 7
---
    public function update(Request $request, Podcast $podcast): RedirectResponse
    {

        // Logged-in user has to be owner
        if ($podcast->user_id != auth()->id()) {
            abort(403, "Unauthorized Action");
        }

        $formFields = $request->validate([
            'title' => 'required',
            'host' => ['required'],
            'location' => 'required',
            'email' => 'required',
            'website' => 'required',
            'tags' => 'required',
            'description' => 'required'
        ]);

        if ($request->hasFile('logo')) {
            $formFields['logo'] = $request->file('logo')->store('logos', 'public');
        }

        if ($request->hasFile('file_name')) {
            $formFields['file_name'] = $request->file('file_name')->store('sounds', 'public');
        }

        $podcast->update($formFields);

SELECT * FROM `podcasts` WHERE `podcasts`.`user_id` = 3 and `podcasts`.`user_id` IS not NULL
---
    public function manage(): Factory|View|Application
    {
        return view('podcasts.manage', ['podcasts' => auth()->user()->podcasts()->get()]);