app/Http/Controllers/StripeController.php

    public function success(Request $request): \Illuminate\Routing\Redirector|Application|\Illuminate\Http\RedirectResponse
    {
        $user = User::find($request->user()->id);
        $user->update(array('paid_member' => true));

        $formFields['user_id'] = $request->user()->id;
        $formFields['name'] = $request->user()->name;
        $formFields['stripe_id'] = $request->user()->id;
        $formFields['stripe_status'] = "successful";
        $formFields['stripe_price'] = "€10.00EUR";

        Subscription::create($formFields);
---
SELECT * FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `paid_member` = 1, `users`.`updated_at` = '2023-03-14 17:36:31' WHERE `id` = 2
INSERT INTO `subscriptions` (`user_id`, `name`, `stripe_id`, `stripe_status`, `stripe_price`, `updated_at`, `created_at`) VALUES (2, 'Basil Patton', 2, 'successful', '€10.00EUR', '2023-03-14 17:36:31', '2023-03-14 17:36:31')