app/Http/Controllers/UserController.php

INSERT INTO `users` (`name`, `email`, `password`, `paid_member`, `updated_at`, `created_at`) VALUES ('Basil Patton', 'kocy@mailinator.com', '$2y$10$d8DkTkeKBlvUxZhq3ijmyuJ2FJbqLcYGbTpenRvwB0mdVCPNf8Xe.', 0, '2023-03-14 17:36:09', '2023-03-14 17:36:09')
---
    public function store(Request $request): Redirector|Application|RedirectResponse
    {
        $formFields = $request->validate([
            'name' => ['required', 'min:3'],
            'email' => ['required', 'email', Rule::unique('users', 'email')],
            'password' => 'required|confirmed|min:6'
        ]);

        // Hash Password
        $formFields['password'] = bcrypt($formFields['password']);

        $formFields['paid_member'] = false;

        // Create User
        $user = User::create($formFields);